Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalDiscrepancyWarning Property
 Distance between Analytical and Physical Models of Structural Element is beyond tolerance of [Value]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AnalyticalDiscrepancyWarning { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalDiscrepancyWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AnalyticalDiscrepancyWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace